app/views/parts/index.html.erb

SELECT "parts".* FROM "parts" WHERE "parts"."category" = $1  [["category", "GPU"]]
---
      <h6>Categories</h6>
      <% Part::CATEGORIES.each do |category| %>