app/controllers/builds_controller.rb

  def index
    @builds = Build.all
---
SELECT "builds".* FROM "builds"