app/controllers/messages_controller.rb

SELECT DISTINCT "messages"."sender_id" FROM "messages" WHERE "messages"."recipient_id" = $1  [["recipient_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    # Fetch distinct users (senders and recipients) involved in conversations with the current user
    sent = current_user.sent_messages.select(:recipient_id).distinct.map(&:recipient_id)
    received = current_user.received_messages.select(:sender_id).distinct.map(&:sender_id)

    # Remove duplicates
    user_ids = (sent + received).uniq
    @conversations = User.where(id: user_ids) # get distinct combos of senders and receivers as conversations

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE ((sender_id = 2 AND recipient_id = 1) OR (sender_id = 1 AND recipient_id = 2)) ORDER BY "messages"."created_at" ASC
---
  def show
    @recipient = User.find(params[:recipient_id])
    @messages = Message.where( # display conversation chronologically
      '(sender_id = :current_user AND recipient_id = :recipient) OR (sender_id = :recipient AND recipient_id = :current_user)',
      current_user: current_user.id,
      recipient:    @recipient.id
    ).order(:created_at)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @message = Message.new
    @recipient = User.find(params[:recipient_id])

INSERT INTO "messages" ("sender_id", "recipient_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sender_id", 2], ["recipient_id", 1], ["content", "hi\r\n"], ["created_at", "2024-12-05 22:48:14.446034"], ["updated_at", "2024-12-05 22:48:14.446034"]]
---
  def create
    @message = current_user.sent_messages.build(message_params)

    if @message.save