app/controllers/pages_controller.rb

  def home
    @builds = Build.where(published: true)
    @parts = Part.first(4)
---
SELECT "builds".* FROM "builds" WHERE "builds"."published" = $1  [["published", true]]
SELECT "parts".* FROM "parts" ORDER BY "parts"."id" ASC LIMIT $1  [["LIMIT", 4]]