app/controllers/parts_controller.rb

  def index
    # @parts = Part.all
    @parts = Part.page(params[:page]).per(8)
---
SELECT "parts".* FROM "parts" LIMIT $1 OFFSET $2  [["LIMIT", 8], ["OFFSET", 0]]

  def show
    @part = Part.find(params[:id])
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @part = Part.find(params[:id])
---
SELECT "parts".* FROM "parts" WHERE "parts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]