app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @builds = @user.builds.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "builds".* FROM "builds" WHERE "builds"."user_id" = $1  [["user_id", 2]]